DFRobot-Embedded-Software/ESP32_BIT/espressif/esp32/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.Model = Model

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length

##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

esp32s3_bit.name=ESP32S3 BIT
esp32s3_bit.vid.0=0x303a
esp32s3_bit.pid.0=0x1001

esp32s3_bit.bootloader.tool=esptool_py
esp32s3_bit.bootloader.tool.default=esptool_py

esp32s3_bit.upload.tool=esptool_py
esp32s3_bit.upload.tool.default=esptool_py
esp32s3_bit.upload.tool.network=esp_ota

esp32s3_bit.upload.maximum_size=1310720
esp32s3_bit.upload.maximum_data_size=327680
esp32s3_bit.upload.flags=
esp32s3_bit.upload.extra_flags=
esp32s3_bit.upload.use_1200bps_touch=false
esp32s3_bit.upload.wait_for_upload_port=false

esp32s3_bit.serial.disableDTR=false
esp32s3_bit.serial.disableRTS=false

esp32s3_bit.build.tarch=xtensa
esp32s3_bit.build.bootloader_addr=0x0
esp32s3_bit.build.target=esp32s3
esp32s3_bit.build.mcu=esp32s3
esp32s3_bit.build.core=esp32
esp32s3_bit.build.variant=esp32s3_bit
esp32s3_bit.build.board=esp32s3_bit

esp32s3_bit.build.usb_mode=1
esp32s3_bit.build.cdc_on_boot=0
esp32s3_bit.build.msc_on_boot=0
esp32s3_bit.build.dfu_on_boot=0
esp32s3_bit.build.f_cpu=240000000L
esp32s3_bit.build.flash_size=4MB
esp32s3_bit.build.flash_freq=80m
esp32s3_bit.build.flash_mode=dio
esp32s3_bit.build.boot=qio
esp32s3_bit.build.boot_freq=80m
esp32s3_bit.build.partitions=default
esp32s3_bit.build.defines=
esp32s3_bit.build.loop_core=
esp32s3_bit.build.event_core=
esp32s3_bit.build.psram_type=qspi
esp32s3_bit.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
esp32s3_bit.menu.JTAGAdapter.default=Disabled
esp32s3_bit.menu.JTAGAdapter.default.build.copy_jtag_files=0
esp32s3_bit.menu.JTAGAdapter.builtin=Integrated USB JTAG
esp32s3_bit.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
esp32s3_bit.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
esp32s3_bit.menu.JTAGAdapter.external=FTDI Adapter
esp32s3_bit.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
esp32s3_bit.menu.JTAGAdapter.external.build.copy_jtag_files=1
esp32s3_bit.menu.JTAGAdapter.bridge=ESP USB Bridge
esp32s3_bit.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
esp32s3_bit.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

esp32s3_bit.menu.PSRAM.disabled=Disabled
esp32s3_bit.menu.PSRAM.disabled.build.defines=
esp32s3_bit.menu.PSRAM.disabled.build.psram_type=qspi
esp32s3_bit.menu.PSRAM.enabled=QSPI PSRAM
esp32s3_bit.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
esp32s3_bit.menu.PSRAM.enabled.build.psram_type=qspi
esp32s3_bit.menu.PSRAM.opi=OPI PSRAM
esp32s3_bit.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
esp32s3_bit.menu.PSRAM.opi.build.psram_type=opi

esp32s3_bit.menu.FlashMode.qio=QIO 80MHz
esp32s3_bit.menu.FlashMode.qio.build.flash_mode=dio
esp32s3_bit.menu.FlashMode.qio.build.boot=qio
esp32s3_bit.menu.FlashMode.qio.build.boot_freq=80m
esp32s3_bit.menu.FlashMode.qio.build.flash_freq=80m
esp32s3_bit.menu.FlashMode.qio120=QIO 120MHz
esp32s3_bit.menu.FlashMode.qio120.build.flash_mode=dio
esp32s3_bit.menu.FlashMode.qio120.build.boot=qio
esp32s3_bit.menu.FlashMode.qio120.build.boot_freq=120m
esp32s3_bit.menu.FlashMode.qio120.build.flash_freq=80m
esp32s3_bit.menu.FlashMode.dio=DIO 80MHz
esp32s3_bit.menu.FlashMode.dio.build.flash_mode=dio
esp32s3_bit.menu.FlashMode.dio.build.boot=dio
esp32s3_bit.menu.FlashMode.dio.build.boot_freq=80m
esp32s3_bit.menu.FlashMode.dio.build.flash_freq=80m
esp32s3_bit.menu.FlashMode.opi=OPI 80MHz
esp32s3_bit.menu.FlashMode.opi.build.flash_mode=dout
esp32s3_bit.menu.FlashMode.opi.build.boot=opi
esp32s3_bit.menu.FlashMode.opi.build.boot_freq=80m
esp32s3_bit.menu.FlashMode.opi.build.flash_freq=80m

esp32s3_bit.menu.FlashSize.4M=4MB (32Mb)
esp32s3_bit.menu.FlashSize.4M.build.flash_size=4MB
esp32s3_bit.menu.FlashSize.8M=8MB (64Mb)
esp32s3_bit.menu.FlashSize.8M.build.flash_size=8MB
esp32s3_bit.menu.FlashSize.8M.build.partitions=default_8MB
esp32s3_bit.menu.FlashSize.16M=16MB (128Mb)
esp32s3_bit.menu.FlashSize.16M.build.flash_size=16MB
#esp32s3.menu.FlashSize.32M=32MB (256Mb)
#esp32s3.menu.FlashSize.32M.build.flash_size=32MB

esp32s3_bit.menu.LoopCore.1=Core 1
esp32s3_bit.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
esp32s3_bit.menu.LoopCore.0=Core 0
esp32s3_bit.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

esp32s3_bit.menu.EventsCore.1=Core 1
esp32s3_bit.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
esp32s3_bit.menu.EventsCore.0=Core 0
esp32s3_bit.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

esp32s3_bit.menu.USBMode.hwcdc=Hardware CDC and JTAG
esp32s3_bit.menu.USBMode.hwcdc.build.usb_mode=1
esp32s3_bit.menu.USBMode.default=USB-OTG (TinyUSB)
esp32s3_bit.menu.USBMode.default.build.usb_mode=0

esp32s3_bit.menu.CDCOnBoot.default=Disabled
esp32s3_bit.menu.CDCOnBoot.default.build.cdc_on_boot=0
esp32s3_bit.menu.CDCOnBoot.cdc=Enabled
esp32s3_bit.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

esp32s3_bit.menu.MSCOnBoot.default=Disabled
esp32s3_bit.menu.MSCOnBoot.default.build.msc_on_boot=0
esp32s3_bit.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
esp32s3_bit.menu.MSCOnBoot.msc.build.msc_on_boot=1

esp32s3_bit.menu.DFUOnBoot.default=Disabled
esp32s3_bit.menu.DFUOnBoot.default.build.dfu_on_boot=0
esp32s3_bit.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
esp32s3_bit.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

esp32s3_bit.menu.UploadMode.default=UART0 / Hardware CDC
esp32s3_bit.menu.UploadMode.default.upload.use_1200bps_touch=false
esp32s3_bit.menu.UploadMode.default.upload.wait_for_upload_port=false
esp32s3_bit.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
esp32s3_bit.menu.UploadMode.cdc.upload.use_1200bps_touch=true
esp32s3_bit.menu.UploadMode.cdc.upload.wait_for_upload_port=true

esp32s3_bit.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32s3_bit.menu.PartitionScheme.default.build.partitions=default
esp32s3_bit.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32s3_bit.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32s3_bit.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
esp32s3_bit.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32s3_bit.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32s3_bit.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32s3_bit.menu.PartitionScheme.minimal.build.partitions=minimal
esp32s3_bit.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32s3_bit.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32s3_bit.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32s3_bit.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32s3_bit.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32s3_bit.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32s3_bit.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32s3_bit.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32s3_bit.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32s3_bit.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32s3_bit.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32s3_bit.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32s3_bit.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32s3_bit.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32s3_bit.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32s3_bit.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32s3_bit.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32s3_bit.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32s3_bit.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
esp32s3_bit.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32s3_bit.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32s3_bit.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32s3_bit.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=large_spiffs_16MB
esp32s3_bit.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=6291456
esp32s3_bit.menu.PartitionScheme.rainmaker=RainMaker
esp32s3_bit.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
esp32s3_bit.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

esp32s3_bit.menu.CPUFreq.240=240MHz (WiFi)
esp32s3_bit.menu.CPUFreq.240.build.f_cpu=240000000L
esp32s3_bit.menu.CPUFreq.160=160MHz (WiFi)
esp32s3_bit.menu.CPUFreq.160.build.f_cpu=160000000L
esp32s3_bit.menu.CPUFreq.80=80MHz (WiFi)
esp32s3_bit.menu.CPUFreq.80.build.f_cpu=80000000L
esp32s3_bit.menu.CPUFreq.40=40MHz
esp32s3_bit.menu.CPUFreq.40.build.f_cpu=40000000L
esp32s3_bit.menu.CPUFreq.20=20MHz
esp32s3_bit.menu.CPUFreq.20.build.f_cpu=20000000L
esp32s3_bit.menu.CPUFreq.10=10MHz
esp32s3_bit.menu.CPUFreq.10.build.f_cpu=10000000L

esp32s3_bit.menu.UploadSpeed.921600=921600
esp32s3_bit.menu.UploadSpeed.921600.upload.speed=921600
esp32s3_bit.menu.UploadSpeed.115200=115200
esp32s3_bit.menu.UploadSpeed.115200.upload.speed=115200
esp32s3_bit.menu.UploadSpeed.256000.windows=256000
esp32s3_bit.menu.UploadSpeed.256000.upload.speed=256000
esp32s3_bit.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32s3_bit.menu.UploadSpeed.230400=230400
esp32s3_bit.menu.UploadSpeed.230400.upload.speed=230400
esp32s3_bit.menu.UploadSpeed.460800.linux=460800
esp32s3_bit.menu.UploadSpeed.460800.macosx=460800
esp32s3_bit.menu.UploadSpeed.460800.upload.speed=460800
esp32s3_bit.menu.UploadSpeed.512000.windows=512000
esp32s3_bit.menu.UploadSpeed.512000.upload.speed=512000

esp32s3_bit.menu.DebugLevel.none=None
esp32s3_bit.menu.DebugLevel.none.build.code_debug=0
esp32s3_bit.menu.DebugLevel.error=Error
esp32s3_bit.menu.DebugLevel.error.build.code_debug=1
esp32s3_bit.menu.DebugLevel.warn=Warn
esp32s3_bit.menu.DebugLevel.warn.build.code_debug=2
esp32s3_bit.menu.DebugLevel.info=Info
esp32s3_bit.menu.DebugLevel.info.build.code_debug=3
esp32s3_bit.menu.DebugLevel.debug=Debug
esp32s3_bit.menu.DebugLevel.debug.build.code_debug=4
esp32s3_bit.menu.DebugLevel.verbose=Verbose
esp32s3_bit.menu.DebugLevel.verbose.build.code_debug=5

esp32s3_bit.menu.EraseFlash.none=Disabled
esp32s3_bit.menu.EraseFlash.none.upload.erase_cmd=
esp32s3_bit.menu.EraseFlash.all=Enabled
esp32s3_bit.menu.EraseFlash.all.upload.erase_cmd=-e

esp32s3_bit.menu.Model.None=None
esp32s3_bit.menu.Model.None.build.Model= {upload.extra_flags}
esp32s3_bit.menu.Model.Model=Model
esp32s3_bit.menu.Model.Model.build.Model= 0x410000 "{runtime.platform.path}/tools/partitions/model.bin" {upload.extra_flags}

##############################################################


